%% hw1
%  
%% 项目名称：数字图像处理课程作业实验一
%  
% 
%  
% 
% 姓名：
% 
% 班级：
% 
% 学号：
% 
% 提交日期：2019年3月1日
% 
%  
% 
%  
%% 摘要
%  
% 
%  
% 
% 本次作业主要以
% 
%  
% 
%  
%% 作业实验任务
%  
% 
%  
%% 1、Bmp图像格式简介,以7.bmp为例说明
% 
% 
% 
%% 2、把lena 512*512图像灰度级逐级递减8-1显示
% 
% 
% 
%% 3、计算lena图像的均值方差
% 
% 
% 
%% 4、把lena图像用近邻、双线性和双三次插值法zoom到2048*2048
% 
% 
% 
%% 5、把lena和elain图像分别进行水平shear（参数可设置为1.5，或者自行选择）和旋转30度，并采用用近邻、双线性和双三次插值法zoom到2048*2048
% 
% 
% 
% 
% 
% 
% 技术讨论和报告
% 
% 讨论结果
% 
% 打印处理结果包括图像
% 
%  
% 
%  
%% 附录
%  
% 
%  
%% 参考文献
%  
% 
%